app/controllers/api/v1/favorites_controller.rb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."favoritable_type" = ?  [["user_id", 1], ["favoritable_type", "Album"]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."favoritable_type" = ?  [["user_id", 1], ["favoritable_type", "Song"]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."favoritable_type" = ?  [["user_id", 1], ["favoritable_type", "Artist"]]
---
    def index
      @favorite_albums = current_user.favorites.where(favoritable_type: "Album").map(&:favoritable)
      @favorite_songs = current_user.favorites.where(favoritable_type: "Song").map(&:favoritable)
      @favorite_artists = current_user.favorites.where(favoritable_type: "Artist").map(&:favoritable)