app/controllers/api/v1/search_controller.rb

SELECT "songs".* FROM "songs" WHERE (title LIKE '%%')
SELECT "albums".* FROM "albums" WHERE (title LIKE '%%')
SELECT "artists".* FROM "artists" WHERE (name LIKE '%%')
---
    def index
        @songs = Song.where('title LIKE ?', "%#{params[:query]}%")
        @albums = Album.where('title LIKE ?', "%#{params[:query]}%")
        @artists = Artist.where('name LIKE ?', "%#{params[:query]}%")